; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v5 ?v7)
             (pred_3 ?v10 ?v9)
             (pred_2 ?v5 ?v9)
             (pred_12 ?v2 ?v5 )
	     (pred_9 ?v5)
             (pred_6 ?v13)
             (pred_8 ?v10)
             (pred_10 ?v9)
             (pred_7 ?v5)
             (pred_11 ?v10)
             (pred_4 ?v5)
             (pred_1 ))



(:action op_4
:parameters (?v1 ?v3 ?v4 ?v8)
:precondition (and (pred_6 ?v1) (pred_6 ?v3) (pred_8 ?v4) (pred_10 ?v8)
          (pred_5 ?v1 ?v3) (pred_3 ?v4 ?v8)
                   (pred_2 ?v3 ?v8) (pred_9 ?v1) 
                   (pred_7 ?v3) (pred_11 ?v4))
:effect (and  (pred_4 ?v3) (not (pred_7 ?v3))))


(:action op_2
:parameters (?v1 ?v11)
:precondition (and (pred_6 ?v1) (pred_6 ?v11)
               (pred_9 ?v1) (pred_5 ?v1 ?v11) (pred_4 ?v11))
:effect (and (pred_9 ?v11) (not (pred_9 ?v1))))

(:action op_3
:parameters (?v1 ?v4)
:precondition (and (pred_6 ?v1) (pred_8 ?v4) 
                  (pred_9 ?v1) (pred_12 ?v4 ?v1) (pred_1 ))
:effect (and (pred_11 ?v4)
   (not (pred_12 ?v4 ?v1)) (not (pred_1 ))))


(:action op_5
:parameters (?v1 ?v12 ?v6)
:precondition (and (pred_6 ?v1) (pred_8 ?v12) (pred_8 ?v6)
                  (pred_9 ?v1) (pred_11 ?v6) (pred_12 ?v12 ?v1))
:effect (and (pred_11 ?v12) (pred_12 ?v6 ?v1)
        (not (pred_11 ?v6)) (not (pred_12 ?v12 ?v1))))

(:action op_1
:parameters (?v1 ?v4)
:precondition (and (pred_6 ?v1) (pred_8 ?v4) 
                  (pred_9 ?v1) (pred_11 ?v4))
:effect (and (pred_1 ) (pred_12 ?v4 ?v1) (not (pred_11 ?v4)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_02 obj_12 obj_25 obj_23 obj_21 obj_28 obj_20 obj_26 obj_27 obj_18 obj_31 obj_29 obj_22 obj_01 obj_15 obj_30 obj_07 obj_11 obj_13 obj_16 obj_19 obj_05 obj_08 obj_06 obj_14
    obj_24 obj_03 obj_09
    obj_17 obj_04 obj_10
    )

    (:init
       (pred_1)

       (pred_6 obj_02)
       (pred_6 obj_12)
       (pred_6 obj_25)
       (pred_6 obj_23)
       (pred_6 obj_21)
       (pred_6 obj_28)
       (pred_6 obj_20)
       (pred_6 obj_26)
       (pred_6 obj_27)
       (pred_6 obj_18)
       (pred_6 obj_31)
       (pred_6 obj_29)
       (pred_6 obj_22)
       (pred_6 obj_01)
       (pred_6 obj_15)
       (pred_6 obj_30)
       (pred_6 obj_07)
       (pred_6 obj_11)
       (pred_6 obj_13)
       (pred_6 obj_16)
       (pred_6 obj_19)
       (pred_6 obj_05)
       (pred_6 obj_08)
       (pred_6 obj_06)
       (pred_6 obj_14)
       (pred_10 obj_24)
       (pred_10 obj_03)
       (pred_10 obj_09)
       (pred_8 obj_17)
       (pred_8 obj_04)
       (pred_8 obj_10)

       (pred_5 obj_02 obj_28)
       (pred_5 obj_02 obj_12)
       (pred_5 obj_12 obj_20)
       (pred_5 obj_12 obj_25)
       (pred_5 obj_12 obj_02)
       (pred_5 obj_25 obj_26)
       (pred_5 obj_25 obj_23)
       (pred_5 obj_25 obj_12)
       (pred_5 obj_23 obj_27)
       (pred_5 obj_23 obj_21)
       (pred_5 obj_23 obj_25)
       (pred_5 obj_21 obj_18)
       (pred_5 obj_21 obj_23)
       (pred_5 obj_28 obj_31)
       (pred_5 obj_28 obj_20)
       (pred_5 obj_28 obj_02)
       (pred_5 obj_20 obj_29)
       (pred_5 obj_20 obj_26)
       (pred_5 obj_20 obj_12)
       (pred_5 obj_20 obj_28)
       (pred_5 obj_26 obj_22)
       (pred_5 obj_26 obj_27)
       (pred_5 obj_26 obj_25)
       (pred_5 obj_26 obj_20)
       (pred_5 obj_27 obj_01)
       (pred_5 obj_27 obj_18)
       (pred_5 obj_27 obj_23)
       (pred_5 obj_27 obj_26)
       (pred_5 obj_18 obj_15)
       (pred_5 obj_18 obj_21)
       (pred_5 obj_18 obj_27)
       (pred_5 obj_31 obj_30)
       (pred_5 obj_31 obj_29)
       (pred_5 obj_31 obj_28)
       (pred_5 obj_29 obj_07)
       (pred_5 obj_29 obj_22)
       (pred_5 obj_29 obj_20)
       (pred_5 obj_29 obj_31)
       (pred_5 obj_22 obj_11)
       (pred_5 obj_22 obj_01)
       (pred_5 obj_22 obj_26)
       (pred_5 obj_22 obj_29)
       (pred_5 obj_01 obj_13)
       (pred_5 obj_01 obj_15)
       (pred_5 obj_01 obj_27)
       (pred_5 obj_01 obj_22)
       (pred_5 obj_15 obj_16)
       (pred_5 obj_15 obj_18)
       (pred_5 obj_15 obj_01)
       (pred_5 obj_30 obj_19)
       (pred_5 obj_30 obj_07)
       (pred_5 obj_30 obj_31)
       (pred_5 obj_07 obj_05)
       (pred_5 obj_07 obj_11)
       (pred_5 obj_07 obj_29)
       (pred_5 obj_07 obj_30)
       (pred_5 obj_11 obj_08)
       (pred_5 obj_11 obj_13)
       (pred_5 obj_11 obj_22)
       (pred_5 obj_11 obj_07)
       (pred_5 obj_13 obj_06)
       (pred_5 obj_13 obj_16)
       (pred_5 obj_13 obj_01)
       (pred_5 obj_13 obj_11)
       (pred_5 obj_16 obj_14)
       (pred_5 obj_16 obj_15)
       (pred_5 obj_16 obj_13)
       (pred_5 obj_19 obj_05)
       (pred_5 obj_19 obj_30)
       (pred_5 obj_05 obj_08)
       (pred_5 obj_05 obj_07)
       (pred_5 obj_05 obj_19)
       (pred_5 obj_08 obj_06)
       (pred_5 obj_08 obj_11)
       (pred_5 obj_08 obj_05)
       (pred_5 obj_06 obj_14)
       (pred_5 obj_06 obj_13)
       (pred_5 obj_06 obj_08)
       (pred_5 obj_14 obj_16)
       (pred_5 obj_14 obj_06)
       (pred_7 obj_05)
       (pred_7 obj_31)
       (pred_7 obj_21)
       (pred_2  obj_05 obj_24)
       (pred_2  obj_31 obj_03)
       (pred_2  obj_21 obj_09)
       (pred_4 obj_02)
       (pred_4 obj_12)
       (pred_4 obj_25)
       (pred_4 obj_23)
       (pred_4 obj_28)
       (pred_4 obj_20)
       (pred_4 obj_26)
       (pred_4 obj_27)
       (pred_4 obj_18)
       (pred_4 obj_29)
       (pred_4 obj_22)
       (pred_4 obj_01)
       (pred_4 obj_15)
       (pred_4 obj_30)
       (pred_4 obj_07)
       (pred_4 obj_11)
       (pred_4 obj_13)
       (pred_4 obj_16)
       (pred_4 obj_19)
       (pred_4 obj_08)
       (pred_4 obj_06)
       (pred_4 obj_14)

       (pred_3  obj_17 obj_24)
       (pred_3  obj_04 obj_03)
       (pred_3  obj_10 obj_09)
       (pred_12 obj_17 obj_13)
       (pred_12 obj_04 obj_19)
       (pred_12 obj_10 obj_12)
       (pred_9 obj_13)
    )

    (:goal (and
       (pred_12 obj_17 obj_19)
       (pred_12 obj_10 obj_30)
    ))
(:constraints
  (always (not (pred_9 obj_11)))
)
)

; plan
1. (op_3 obj_13 obj_17)
   deleted: (pred_12 obj_17 obj_13) (pred_1)
   added: (pred_11 obj_17)
   goals met: 0 of 2
2. (op_2 obj_13 obj_01)
   deleted: (pred_9 obj_13)
   added: (pred_9 obj_01)
   goals met: 0 of 2
3. (op_2 obj_01 obj_22)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_22)
   goals met: 0 of 2
4. (op_2 obj_22 obj_29)
   deleted: (pred_9 obj_22)
   added: (pred_9 obj_29)
   goals met: 0 of 2
5. (op_2 obj_29 obj_20)
   deleted: (pred_9 obj_29)
   added: (pred_9 obj_20)
   goals met: 0 of 2
6. (op_2 obj_20 obj_12)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_12)
   goals met: 0 of 2
7. (op_5 obj_12 obj_10 obj_17)
   deleted: (pred_11 obj_17) (pred_12 obj_10 obj_12)
   added: (pred_11 obj_10) (pred_12 obj_17 obj_12)
   goals met: 0 of 2
8. (op_2 obj_12 obj_20)
   deleted: (pred_9 obj_12)
   added: (pred_9 obj_20)
   goals met: 0 of 2
9. (op_2 obj_20 obj_29)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_29)
   goals met: 0 of 2
10. (op_2 obj_29 obj_07)
   deleted: (pred_9 obj_29)
   added: (pred_9 obj_07)
   goals met: 0 of 2
11. (op_2 obj_07 obj_30)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_30)
   goals met: 0 of 2
12. (op_1 obj_30 obj_10)
   deleted: (pred_11 obj_10)
   added: (pred_1) (pred_12 obj_10 obj_30)
   goals met: 1 of 2
13. (op_2 obj_30 obj_07)
   deleted: (pred_9 obj_30)
   added: (pred_9 obj_07)
   goals met: 1 of 2
14. (op_2 obj_07 obj_29)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_29)
   goals met: 1 of 2
15. (op_2 obj_29 obj_20)
   deleted: (pred_9 obj_29)
   added: (pred_9 obj_20)
   goals met: 1 of 2
16. (op_2 obj_20 obj_12)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_12)
   goals met: 1 of 2
17. (op_3 obj_12 obj_17)
   deleted: (pred_12 obj_17 obj_12) (pred_1)
   added: (pred_11 obj_17)
   goals met: 1 of 2
18. (op_2 obj_12 obj_20)
   deleted: (pred_9 obj_12)
   added: (pred_9 obj_20)
   goals met: 1 of 2
19. (op_2 obj_20 obj_29)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_29)
   goals met: 1 of 2
20. (op_2 obj_29 obj_07)
   deleted: (pred_9 obj_29)
   added: (pred_9 obj_07)
   goals met: 1 of 2
21. (op_2 obj_07 obj_30)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_30)
   goals met: 1 of 2
22. (op_2 obj_30 obj_19)
   deleted: (pred_9 obj_30)
   added: (pred_9 obj_19)
   goals met: 1 of 2
23. (op_5 obj_19 obj_04 obj_17)
   deleted: (pred_11 obj_17) (pred_12 obj_04 obj_19)
   added: (pred_11 obj_04) (pred_12 obj_17 obj_19)
   goals met: 2 of 2
